export const COMMON_MSG = {
  auth: {
    login: 'Користувача за вказаним телефоном та паролем не знайдено',
      phone:'Невірний номер телефону',
      pass:'Невірний пароль',
      number: 'Номер телефону має бути 12 цифр',
      password: 'Пароль має бути 6-15 символів',
  },
  job:{
    apply: 'Ви подали заявку на данну пропозицію',
    share: 'Ви поділилися обраною пропозицією з друзями',
    remove: 'Ви відхилили пропозицію'
  },
  my_job:{
    remove: 'Заявку видаленно'
  },
  user: {
    phone:'Невірний номер телефону',
    pass:'Невірний пароль',
    create: 'Реєстрація пройшла успішно. Увійдіть iз вашими данними',
    err: 'Користувач iз вказанним номером вже існує',
    empty: 'Заповніть всі поля',
    number: 'Номер телефону має бути 12 цифр',
      numb:'Невірний номер телефону',
    password: 'Пароль має бути 6-15 символів',
    update: 'Інформацію успішно оновлено',
    remove: 'Користувача успішно видаленно',
    emailerr: 'email не відповідає стандартам',
    field: "Ім'я або прізвище не відповідає стандартам",
    city: 'Назва міста не відповідає стандартам',
      send:"Ваше повідомлення надіслано",
      password1:'Помилка зміни паролю',
      passChange:'Пароль змінено',
      smsCod:'Смс з кодом підтвердження надіслано',
      codeerr:'Невірний код підтвердження',
      //errpassword:'Помилка отримання коду',
      reset:'Пароль відновлено',
      erro:'Пароль не відновлено',
      code:'Відновлення',
      codeer:'Невірний код підтвердження',
      validErr:'Некоректно введений номер телефону'
  },
  skill: {
    create: 'Навички збережено успішно',
    update: 'Інформацію успішно оновлено',
    remove: 'Навички видаленні'
  },
  connection: {
    onConnect: "З'єднання з мережею поновлено",
    onDisconnect: "Відсутнє з'єднання з мережею"
  },
    friend: {
        add:"Заявку надіслано",
        err:"Помилка",
        addf:"Користувача додано до обраних",
        delf:'Кориcтувача видалено з обраних'
    }

};
